Revit 2027 API
RebarFreeFormAccessor.Flip3dPathSet Method
 For a free form set distributed along a 3D path, this method flips the distribution path. The set should not have Single layout rule.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Flip3dPathSet()
Public Sub Flip3dPathSet
public:
void Flip3dPathSet()
member Flip3dPathSet : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar is not created with the 3D Path Free Form rebar server. -or- Rebar has Single layout rule.
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace